Catalogs/Комнаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>Комнаты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКомнаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыКомнат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Комнаты/Ext/ManagerModule.bsl
Функция ПолучитьНаименование(Объект) Экспорт

	Если ЗначениеЗаполнено(Объект.ТипКомнаты) Тогда
		Возврат Шаблон("[ТипКомнаты] № [Номер]", 
			Новый Структура("ТипКомнаты,Номер", Объект.ТипКомнаты, Объект.Номер));
	КонецЕсли; 
	
	Возврат "№ " + Объект.Номер; 
		
КонецФункции // ПолучитьНаименование()

Функция ПолучитьОчереднойКод(Объект) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	МАКСИМУМ(Комнаты.Номер) КАК Код
		|ИЗ
		|	Справочник.Комнаты КАК Комнаты
		|ГДЕ
		|	НЕ Комнаты.Ссылка = &Ссылка");
	Если (Объект = Неопределено) Тогда
		Запрос.УстановитьПараметр("Ссылка", Неопределено);
	Иначе
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	КонецЕсли; 	
	Выборка = Запрос.Выполнить().Выбрать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Код) Тогда
		Возврат Выборка.Код + 1;
	КонецЕсли;
	
	Возврат 1;
	
КонецФункции // ПолучитьОчереднойКод()
